#+Title: Curl Anots
#+Subtitle:



   #+NAME:  setup                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      #api key do projeto mapas do ipgg
      export ApiKey=AIzaSyCGEwTaC8er9BnunFBX8tkZjBKZDgl7jZk 
   #+END_SRC

   #+RESULTS: setup

https://firebase.google.com/docs/reference/rest/auth/
https://firebase.google.com/docs/firestore/use-rest-api
https://firebase.google.com/docs/reference/rest/auth/

   #+NAME:  1                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      curl -v 'https://identitytoolkit.googleapis.com/v1/accounts:signInWithCustomToken?key=$ApiKey'
   #+END_SRC

   #+RESULTS: 1
   #+begin_example

   > > *   Trying 172.217.30.106...
   ,* TCP_NODELAY set
   0)
   ,* ALPN, offering h2
   ,* ALPN, offering http/1.1
   ,* successfully set certificate verify locations:
   ,*   CAfile: /etc/pki/tls/certs/ca-bundle.crt
     CApath: none
   ,* TLSv1.3 (OUT), TLS handshake, Client hello (1):
   ,* TLSv1.3 (IN), TLS handshake, Server hello (2):
   ,* TLSv1.3 (IN), TLS handshake, [no content] (0):
   ,* TLSv1.3 (IN), TLS handshake, Encrypted Extensions (8):
   ,* TLSv1.3 (IN), TLS handshake, Certificate (11):
   ,* TLSv1.3 (IN), TLS handshake, CERT verify (15):
   ,* TLSv1.3 (IN), TLS handshake, Finished (20):
   ,* TLSv1.3 (OUT), TLS change cipher, Change cipher spec (1):
   ,* TLSv1.3 (OUT), TLS handshake, [no content] (0):
   ,* TLSv1.3 (OUT), TLS handshake, Finished (20):
   ,* SSL connection using TLSv1.3 / TLS_AES_256_GCM_SHA384
   ,* ALPN, server accepted to use h2
   ,* Server certificate:
   ,*  subject: C=US; ST=California; L=Mountain View; O=Google LLC; CN=*.googleapis.com
   ,*  start date: Oct  3 17:15:29 2019 GMT
   ,*  expire date: Dec 26 17:15:29 2019 GMT
   ,*  subjectAltName: host "identitytoolkit.googleapis.com" matched cert's "*.googleapis.com"
   ,*  issuer: C=US; O=Google Trust Services; CN=GTS CA 1O1
   ,*  SSL certificate verify ok.
   ,* Using HTTP2, server supports multi-use
   ,* Connection state changed (HTTP/2 confirmed)
   ,* Copying HTTP/2 data in stream buffer to connection buffer after upgrade: len=0
   ,* TLSv1.3 (OUT), TLS app data, [no content] (0):
   ,* TLSv1.3 (OUT), TLS app data, [no content] (0):
   ,* TLSv1.3 (OUT), TLS app data, [no content] (0):
   ,* Using Stream ID: 1 (easy handle 0x5642641b3490)
   ,* TLSv1.3 (OUT), TLS app data, [no content] (0):
   POST /v1/accounts:signInWithCustomToken?key=$ApiKey HTTP/2
   Host: identitytoolkit.googleapis.com
   User-Agent: curl/7.61.1
   Accept: */*
   Content-Type: application/json
   Content-Length: 51
   ,* TLSv1.3 (OUT), TLS app data, [no content] (0):
   ,* We are completely uploaded and fine
   ,* TLSv1.3 (IN), TLS handshake, [no content] (0):
   ,* TLSv1.3 (IN), TLS handshake, Newsession Ticket (4):
   ,* TLSv1.3 (IN), TLS handshake, Newsession Ticket (4):
   ,* TLSv1.3 (IN), TLS app data, [no content] (0):
   ,* Connection state changed (MAX_CONCURRENT_STREAMS == 100)!
   ,* TLSv1.3 (OUT), TLS app data, [no content] (0):
   ,* TLSv1.3 (IN), TLS app data, [no content] (0):
   ,* TLSv1.3 (IN), TLS app data, [no content] (0):
   < HTTP/2 400 
   < vary: X-Origin
   < vary: Referer
   < vary: Origin,Accept-Encoding
   < content-type: application/json; charset=UTF-8
   < date: Sun, 20 Oct 2019 04:04:12 GMT
   < server: ESF
   < cache-control: private
   < x-xss-protection: 0
   < x-frame-options: SAMEORIGIN
   < x-content-type-options: nosniff
   < alt-svc: quic=":443"; ma=2592000; v="46,43",h3-Q048=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000
   < accept-ranges: none
   < 
   ,* TLSv1.3 (IN), TLS app data, [no content] (0):
   {
     "error": {
       "code": 400,
       "message": "API key not valid. Please pass a valid API key.",
       "errors": [
         {
           "message": "API key not valid. Please pass a valid API key.",
           "domain": "global",
           "reason": "badRequest"
         }
       ],
       "status": "INVALID_ARGUMENT"
     }
   }
   ,* TLSv1.3 (IN), TLS app data, [no content] (0):
   0 to host identitytoolkit.googleapis.com left intact
   #+end_example
